In [762]:
import pandas as pd
from collections import Counter
import numpy as np

In [763]:
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

In [764]:
"""Name
Gender
Age
Income
Company"""

'Name\nGender\nAge\nIncome\nExpence\nCompany'

# DataFrame Creation for  male_age_accept

### Creating age
#avg_men life acceptancy 68
#avg_female life acceptancy 70

In [766]:
male_age_accept=np.random.randint(25,62,size=3000) #loan accepted here
male_age_reject=np.random.randint(63,68,size=500)  #loan rejected here mainly deu to age
male_age_reject2=np.random.randint(25,62,size=1500) #loan rejected here mainly due to low income low savings and high age

In [767]:
male_age_accept=male_age_accept.tolist()#converting to list
male_age_reject=male_age_reject.tolist()#converting to list
male_age_reject2=male_age_reject2.tolist()#converting to list

In [768]:
female_age_accept=np.random.randint(25,63,size=3000)#loan accepted here
female_age_reject=np.random.randint(64,71,size=500) #loan rejected here mainly deu to age
female_age_reject2=np.random.randint(25,71,size=1500)#loan rejected here mainly due to low income low savings and high age

In [769]:
female_age_accept=female_age_accept.tolist() #converting to list
female_age_reject=female_age_reject.tolist()
female_age_reject2=female_age_reject2.tolist()

### DataFrame Creation

In [770]:
df_male_age_accept=pd.DataFrame(male_age_accept,columns=["Age"])
df_male_age_reject=pd.DataFrame(male_age_reject,columns=["Age"])
df_male_age_reject2=pd.DataFrame(male_age_reject2,columns=["Age"])
df_female_age_accept=pd.DataFrame(female_age_accept,columns=["Age"])
df_female_age_reject=pd.DataFrame(female_age_reject,columns=["Age"])
df_female_age_reject2=pd.DataFrame(female_age_reject2,columns=["Age"])

### Creating Income unit is Rs. per annum

![title](Salary.png)
https://www.averagesalarysurvey.com/india

In [771]:
"""20-26 =3,7
27-32=7,11
33-38=11,18
39-44=11,25
45-50=25,29
51-56=29,34
57-62=34-26
63-68=26-20"""

'20-26 =3,7\n27-32=7,11\n33-38=11,18\n39-44=11,25\n45-50=25,29\n51-56=29,34\n57-62=34-26\n63-68=26-20'

###  Creating Income
Income here is based on the survey image above.
Income low to high here as this data is for loan accepted

In [772]:
#for accept
df_male_age_accept["Income"]=0
#print(df_male_age_accept)

In [773]:

for index,val in enumerate(df_male_age_accept["Age"]):
    if(val<=25):
        df_male_age_accept["Income"][index]=round(np.random.randint(300000,700000)/1000)*1000
    if(val>=26 and val<32):
        df_male_age_accept["Income"][index]=round(np.random.randint(700000,1100000)/1000)*1000
    if(val>=32 and val<38):
        df_male_age_accept["Income"][index]=round(np.random.randint(1100000,1800000)/1000)*1000
    if(val>=38 and val<44):
        df_male_age_accept["Income"][index]=round(np.random.randint(1800000,2500000)/1000)*1000
    if(val>=44 and val<50):
        df_male_age_accept["Income"][index]=round(np.random.randint(2500000,2900000)/1000)*1000
    if(val>=50 and val<57):
        df_male_age_accept["Income"][index]=round(np.random.randint(2900000,3400000)/1000)*1000
    if(val>=57 and val<62):
        df_male_age_accept["Income"][index]=round(np.random.randint(2600000,3400000)/1000)*1000
    if(val>=62 and val<=68):
        df_male_age_accept["Income"][index]=round(np.random.randint(2000000,2600000)/1000)*1000

###  Creating Expences

       
       salary range    savings
        3,11   lpa    =15-20%
        11,18 lpa     =21-25%
        18,34 lpa     =25-40%
        Savings are in decent to high as this data is for loan accepted

In [774]:
df_male_age_accept["Expences"]=0

In [775]:
for index,income in enumerate(df_male_age_accept["Income"]):
    if(income>=300000 and income<1100000):
        saving=np.random.randint(15,20)
        df_male_age_accept["Expences"][index]=((100-saving)*income)/100
    if(income>=1100000 and income<1800000):
        saving=np.random.randint(21,25)
        df_male_age_accept["Expences"][index]=((100-saving)*income)/100
    if(income>=1800000 and income<=3400000):
        saving=np.random.randint(25,40)
        df_male_age_accept["Expences"][index]=((100-saving)*income)/100

In [776]:
df_male_age_accept.head()

   Age   Income  Expences
0   56  3029000   1847690
1   29   796000    644760
2   50  3011000   2167920
3   46  2900000   2059000
4   36  1746000   1361880

### Creation of Gender

In [777]:
df_male_age_accept["Gender"]="M"

In [778]:
df_male_age_accept.head()

   Age   Income  Expences Gender
0   56  3029000   1847690      M
1   29   796000    644760      M
2   50  3011000   2167920      M
3   46  2900000   2059000      M
4   36  1746000   1361880      M

### Creation of  Company
rank 1 is good company  
rank 2 is normal company   
rank 3 is unknown company

In [779]:
df_male_age_accept["Company"]="Rank 1"
for index,income in enumerate(df_male_age_accept["Income"]):
    if(income>=300000 and income<1500000):
        df_male_age_accept["Company"][index]="Rank 2"
    if(income>=1500000 and income<1800000):
        df_male_age_accept["Company"][index]="Rank 1"
    if(income>=1800000 and income<=3400000):
        df_male_age_accept["Company"][index]="Rank 1"

<ipython-input-779-96a34f2c470f>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_accept["Company"][index]="Rank 1"
<ipython-input-779-96a34f2c470f>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_accept["Company"][index]="Rank 2"
<ipython-input-779-96a34f2c470f>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_accept["Company"][index]="Rank 1"

###  Randomly adding rank 3 and rank 2 for accepted loan

In [780]:
#adding 20% of total as a Rank 3 company
for i in range(int(df_male_age_accept.shape[0]*0.2)):
    index=np.random.randint(0,df_male_age_accept.shape[0]-1)
    df_male_age_accept["Company"][index]="Rank 3"
#adding 30% of total as a Rank 2 company
for i in range(int(df_male_age_accept.shape[0]*0.3)):
    index=np.random.randint(0,df_male_age_accept.shape[0]-1)
    df_male_age_accept["Company"][index]="Rank 2"

<ipython-input-780-9ebc3cfc304e>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_accept["Company"][index]="Rank 3"
<ipython-input-780-9ebc3cfc304e>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_accept["Company"][index]="Rank 2"

In [781]:
df_male_age_accept.head()

   Age   Income  Expences Gender Company
0   56  3029000   1847690      M  Rank 1
1   29   796000    644760      M  Rank 2
2   50  3011000   2167920      M  Rank 2
3   46  2900000   2059000      M  Rank 1
4   36  1746000   1361880      M  Rank 2

### Loan

In [782]:
df_male_age_accept["Loan"]="Accepted"

In [783]:
df_male_age_accept.head()

   Age   Income  Expences Gender Company      Loan
0   56  3029000   1847690      M  Rank 1  Accepted
1   29   796000    644760      M  Rank 2  Accepted
2   50  3011000   2167920      M  Rank 2  Accepted
3   46  2900000   2059000      M  Rank 1  Accepted
4   36  1746000   1361880      M  Rank 2  Accepted

# DataFrame Creation for male_age_reject
#loan rejected here mainly deu to age

In [784]:
df_male_age_reject.describe()

              Age
count  500.000000
mean    64.994000
std      1.383399
min     63.000000
25%     64.000000
50%     65.000000
75%     66.000000
max     67.000000

### Creation for income 
since this dataframe is the data for rejection so I have taken low to avg income.
Idea is that both high age and low salary may be the factor which might lead to rejection of a Loan

In [785]:
df_male_age_reject["Income"]=0

In [786]:
for index in range(df_male_age_reject.shape[0]):
    df_male_age_reject["Income"][index]=round(np.random.randint(300000,1200000)/1000)*1000

In [787]:
df_male_age_reject.head()

   Age  Income
0   67  606000
1   67  910000
2   64  607000
3   67  635000
4   64  477000

### Creation of Expences
Idea here is to give high expences which also contribute for the rejection of loan   
I am considering 85-95% of expenditure of income.

In [788]:
df_male_age_reject["Expences"]=0

In [789]:
for index,income in enumerate(df_male_age_reject["Income"]):
    saving=np.random.randint(5,15)
    df_male_age_reject["Expences"][index]=((100-saving)*income)/100

In [790]:
df_male_age_reject.head()

   Age  Income  Expences
0   67  606000    533280
1   67  910000    855400
2   64  607000    528090
3   67  635000    603250
4   64  477000    419760

### Gender

In [791]:
df_male_age_reject["Gender"]="M"

In [792]:
df_male_age_reject.head()

   Age  Income  Expences Gender
0   67  606000    533280      M
1   67  910000    855400      M
2   64  607000    528090      M
3   67  635000    603250      M
4   64  477000    419760      M

### Company
My thought here is to put rank 3 company for those people with low salary and rank 2 company for those people with salary higher than 6lakh

In [793]:
df_male_age_reject["Company"]="Rank 3"

In [794]:
#adding 10% of data as rank 2
for i in range(int(df_male_age_reject.shape[0]*0.10)):
    index=np.random.randint(0,df_male_age_reject.shape[0]-1)
    df_male_age_reject["Company"][index]="Rank 2"
#adding 5% od data as rank 2
for i in range(int(df_male_age_reject.shape[0]*0.15)):
    index=np.random.randint(0,df_male_age_reject.shape[0]-1)
    df_male_age_reject["Company"][index]="Rank 1"

<ipython-input-794-3a0b0cce80ec>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_reject["Company"][index]="Rank 2"
<ipython-input-794-3a0b0cce80ec>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_reject["Company"][index]="Rank 1"

In [795]:
df_male_age_reject.head()

   Age  Income  Expences Gender Company
0   67  606000    533280      M  Rank 3
1   67  910000    855400      M  Rank 3
2   64  607000    528090      M  Rank 3
3   67  635000    603250      M  Rank 3
4   64  477000    419760      M  Rank 3

In [796]:
Counter(df_male_age_reject["Company"])

Counter({'Rank 3': 391, 'Rank 1': 68, 'Rank 2': 41})

### Loan

In [797]:
df_male_age_reject["Loan"]="Rejected"

In [798]:
df_male_age_reject.head()

   Age  Income  Expences Gender Company      Loan
0   67  606000    533280      M  Rank 3  Rejected
1   67  910000    855400      M  Rank 3  Rejected
2   64  607000    528090      M  Rank 3  Rejected
3   67  635000    603250      M  Rank 3  Rejected
4   64  477000    419760      M  Rank 3  Rejected

# male_age_reject2

In [799]:
df_male_age_reject2.head()

   Age
0   59
1   44
2   54
3   48
4   53

### Income
Since this is also a rejection list, income won't be much high.
age<30 will have low salary
30-55 will have medium salary 
55-68 some medium and some high

In [800]:
df_male_age_reject2["Income"]=0

In [801]:
for index,val in enumerate(df_male_age_accept["Age"]):
    if(val<=25):
        df_male_age_reject2["Income"][index]=round(np.random.randint(150000,300000)/1000)*1000
    if(val>=26 and val<36):
        df_male_age_reject2["Income"][index]=round(np.random.randint(300000,700000)/1000)*1000
    if(val>=36 and val<50):
        df_male_age_reject2["Income"][index]=round(np.random.randint(700000,1200000)/1000)*1000
    if(val>=50 and val<57):
        df_male_age_reject2["Income"][index]=round(np.random.randint(1200000,1400000)/1000)*1000
    if(val>=57 and val<=68):
        df_male_age_reject2["Income"][index]=round(np.random.randint(700000,1200000)/1000)*1000

### Expences
expences will be from high to medium i.e from 80-97% of the income

In [802]:
df_male_age_reject2["Expences"]=0

In [803]:
for index,income in enumerate(df_male_age_reject2["Income"]):
    if(income>=150000 and income<300000):
        saving=np.random.randint(3,7)
        df_male_age_reject2["Expences"][index]=((100-saving)*income)/100
    if(income>=300000 and income<1200000):
        saving=np.random.randint(12,15)
        df_male_age_reject2["Expences"][index]=((100-saving)*income)/100
    if(income>=1200000 and income<=1400000):
        saving=np.random.randint(15,18)
        df_male_age_reject2["Expences"][index]=((100-saving)*income)/100

In [804]:
df_male_age_reject2.head()

   Age   Income  Expences
0   59  1214000   1019760
1   44   490000    431200
2   54  1337000   1123080
3   48   899000    773140
4   53   814000    716320

In [805]:
df_male_age_reject2["Gender"]="M"

In [806]:
df_male_age_reject2["Company"]="Rank 3"

In [807]:
for index,income in enumerate(df_male_age_reject2["Income"]):
    if(income>=80000 and income<1400000):
        df_male_age_reject2["Company"][index]="Rank 2"
    if(income>=340000 and income<800000):
        df_male_age_reject2["Company"][index]="Rank 3"
    if(income>=150000 and income<340000):
        df_male_age_reject2["Company"][index]="Rank 3"

<ipython-input-807-a9de15a4ed95>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_reject2["Company"][index]="Rank 2"
<ipython-input-807-a9de15a4ed95>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_reject2["Company"][index]="Rank 3"
<ipython-input-807-a9de15a4ed95>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_male_age_reject2["Company"][index]="Rank 3"

In [808]:
Counter(df_male_age_reject2["Company"])

Counter({'Rank 2': 872, 'Rank 3': 628})

In [809]:
df_male_age_reject2["Loan"]="Rejected"

In [810]:
df_male_age_reject2.head()

   Age   Income  Expences Gender Company      Loan
0   59  1214000   1019760      M  Rank 2  Rejected
1   44   490000    431200      M  Rank 3  Rejected
2   54  1337000   1123080      M  Rank 2  Rejected
3   48   899000    773140      M  Rank 2  Rejected
4   53   814000    716320      M  Rank 2  Rejected

# DataFrame for female_age_accept

In [811]:
df_female_age_accept.head()

   Age
0   31
1   41
2   40
3   36
4   39

### Income
since this is for accepted loan, it will have medium to high salary

In [812]:
df_female_age_accept["Income"]=0

In [813]:

for index,val in enumerate(df_female_age_accept["Age"]):
    if(val<=25):
        df_female_age_accept["Income"][index]=round(np.random.randint(300000,700000)/1000)*1000
    if(val>=26 and val<32):
        df_female_age_accept["Income"][index]=round(np.random.randint(700000,1100000)/1000)*1000
    if(val>=32 and val<38):
        df_female_age_accept["Income"][index]=round(np.random.randint(1100000,1600000)/1000)*1000
    if(val>=38 and val<44):
        df_female_age_accept["Income"][index]=round(np.random.randint(1600000,2200000)/1000)*1000
    if(val>=44 and val<50):
        df_female_age_accept["Income"][index]=round(np.random.randint(2200000,2700000)/1000)*1000
    if(val>=50 and val<57):
        df_female_age_accept["Income"][index]=round(np.random.randint(2700000,3200000)/1000)*1000
    if(val>=57 and val<62):
        df_female_age_accept["Income"][index]=round(np.random.randint(2200000,3000000)/1000)*1000
    if(val>=62 and val<68):
        df_female_age_accept["Income"][index]=round(np.random.randint(1600000,2200000)/1000)*1000
    if(val>=68 and val<=71):
        df_female_age_accept["Income"][index]=round(np.random.randint(700000,1600000)/1000)*1000

In [814]:
df_female_age_accept.head()

   Age   Income
0   31  1045000
1   41  2197000
2   40  1607000
3   36  1534000
4   39  1957000

### Creation of expences
expences  ranges from 85-60% of income which I belive is a decent and may be one of the reason for the acceptance for loan

In [815]:
df_female_age_accept["Expences"]=0

In [816]:
for index,income in enumerate(df_female_age_accept["Income"]):
    if(income>=300000 and income<1100000):
        saving=np.random.randint(15,20)
        df_female_age_accept["Expences"][index]=((100-saving)*income)/100
    if(income>=1100000 and income<1800000):
        saving=np.random.randint(21,25)
        df_female_age_accept["Expences"][index]=((100-saving)*income)/100
    if(income>=1800000 and income<=3400000):
        saving=np.random.randint(25,40)
        df_female_age_accept["Expences"][index]=((100-saving)*income)/100

In [817]:
df_female_age_accept.head()

   Age   Income  Expences
0   31  1045000    877800
1   41  2197000   1647750
2   40  1607000   1237390
3   36  1534000   1181180
4   39  1957000   1291620

### Gender

In [818]:
df_female_age_accept["Gender"]="F"

### Company
 company will be mostly rank1 and rank2 company and few rank 3

In [819]:
df_female_age_accept["Company"]="Rank 1"

In [820]:
for index,income in enumerate(df_female_age_accept["Income"]):
    if(income>=300000 and income<1500000):
        df_female_age_accept["Company"][index]="Rank 2"
    if(income>=1500000 and income<1800000):
        df_female_age_accept["Company"][index]="Rank 1"
    if(income>=1800000 and income<=3400000):
        df_female_age_accept["Company"][index]="Rank 1"

<ipython-input-820-3545e1a35b00>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_accept["Company"][index]="Rank 2"
<ipython-input-820-3545e1a35b00>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_accept["Company"][index]="Rank 1"
<ipython-input-820-3545e1a35b00>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_accept["Company"][index]="Rank 1"

#### randomly adding 5% of total as Rank 3 company

In [821]:
for i in range(int(df_female_age_accept.shape[0]*0.20)):
    index=np.random.randint(0,df_female_age_accept.shape[0]-1)
    df_female_age_accept["Company"][index]="Rank 3"
for i in range(int(df_female_age_accept.shape[0]*0.3)):
    index=np.random.randint(0,df_female_age_accept.shape[0]-1)
    df_female_age_accept["Company"][index]="Rank 2"

<ipython-input-821-02a8c6b56079>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_accept["Company"][index]="Rank 3"
<ipython-input-821-02a8c6b56079>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_accept["Company"][index]="Rank 2"

In [822]:
df_female_age_accept.head()

   Age   Income  Expences Gender Company
0   31  1045000    877800      F  Rank 2
1   41  2197000   1647750      F  Rank 1
2   40  1607000   1237390      F  Rank 1
3   36  1534000   1181180      F  Rank 1
4   39  1957000   1291620      F  Rank 1

### Loan

In [823]:
df_female_age_accept["Loan"]="Accepted"

In [824]:
df_female_age_accept.head()

   Age   Income  Expences Gender Company      Loan
0   31  1045000    877800      F  Rank 2  Accepted
1   41  2197000   1647750      F  Rank 1  Accepted
2   40  1607000   1237390      F  Rank 1  Accepted
3   36  1534000   1181180      F  Rank 1  Accepted
4   39  1957000   1291620      F  Rank 1  Accepted

# Creation for female_age_reject

In [825]:
df_female_age_reject.head()

   Age
0   65
1   65
2   65
3   66
4   70

### Income

In [826]:
df_female_age_reject["Income"]=0

In [827]:
for index in range(df_male_age_reject.shape[0]):
    df_female_age_reject["Income"][index]=round(np.random.randint(300000,1200000)/1000)*1000

In [828]:
df_female_age_reject.head()

   Age  Income
0   65  315000
1   65  387000
2   65  658000
3   66  306000
4   70  980000

### Creation of Expences
Idea here is to give high expences which also contribute for the rejection of loan   
I am considering 85-95% of expenditure of income.

In [829]:
df_female_age_reject["Expences"]=0

In [830]:
for index,income in enumerate(df_female_age_reject["Income"]):
    saving=np.random.randint(5,15)
    df_female_age_reject["Expences"][index]=((100-saving)*income)/100

In [831]:
df_female_age_reject.head()

   Age  Income  Expences
0   65  315000    296100
1   65  387000    363780
2   65  658000    572460
3   66  306000    266220
4   70  980000    842800

In [832]:
df_female_age_reject["Gender"]="F"

In [833]:
df_female_age_reject.head()

   Age  Income  Expences Gender
0   65  315000    296100      F
1   65  387000    363780      F
2   65  658000    572460      F
3   66  306000    266220      F
4   70  980000    842800      F

### Company
most of the company is rank3 and those people with more than 6 lakh will have ranke 2 company and few rank 1

In [834]:
df_female_age_reject["Company"]="Rank 3"

In [835]:
for index,income in enumerate(df_female_age_reject["Income"]):
    if income>1000000:
        df_female_age_reject["Company"][index]="Rank 2"

<ipython-input-835-a6cd691224bb>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_reject["Company"][index]="Rank 2"

In [836]:
df_female_age_reject.head()

   Age  Income  Expences Gender Company
0   65  315000    296100      F  Rank 3
1   65  387000    363780      F  Rank 3
2   65  658000    572460      F  Rank 3
3   66  306000    266220      F  Rank 3
4   70  980000    842800      F  Rank 3

#### randomly adding 5% of total as Rank 1 company

In [837]:
for i in range(int(df_female_age_reject.shape[0]*0.15)):
    index=np.random.randint(0,df_female_age_reject.shape[0]-1)
    df_female_age_accept["Company"][index]="Rank 1"

<ipython-input-837-f9f349e087b2>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_accept["Company"][index]="Rank 1"

In [838]:
df_female_age_reject.head()

   Age  Income  Expences Gender Company
0   65  315000    296100      F  Rank 3
1   65  387000    363780      F  Rank 3
2   65  658000    572460      F  Rank 3
3   66  306000    266220      F  Rank 3
4   70  980000    842800      F  Rank 3

In [839]:
df_female_age_reject["Loan"]="Rejected"

In [840]:
df_female_age_reject.head()

   Age  Income  Expences Gender Company      Loan
0   65  315000    296100      F  Rank 3  Rejected
1   65  387000    363780      F  Rank 3  Rejected
2   65  658000    572460      F  Rank 3  Rejected
3   66  306000    266220      F  Rank 3  Rejected
4   70  980000    842800      F  Rank 3  Rejected

# Creation for female_age_reject2

In [841]:
df_female_age_reject2.describe()

               Age
count  1500.000000
mean     47.140000
std      13.320361
min      25.000000
25%      36.000000
50%      47.000000
75%      59.000000
max      70.000000

### imcomoe

In [842]:
df_female_age_reject2["Income"]=0

In [843]:
for index,val in enumerate(df_female_age_reject2["Age"]):
    if(val<=25):
        df_female_age_reject2["Income"][index]=round(np.random.randint(150000,300000)/1000)*1000
    if(val>=26 and val<36):
        df_female_age_reject2["Income"][index]=round(np.random.randint(300000,600000)/1000)*1000
    if(val>=36 and val<50):
        df_female_age_reject2["Income"][index]=round(np.random.randint(600000,1100000)/1000)*1000
    if(val>=50 and val<57):
        df_female_age_reject2["Income"][index]=round(np.random.randint(1100000,1300000)/1000)*1000
    if(val>=57 and val<=70):
        df_female_age_reject2["Income"][index]=round(np.random.randint(700000,1100000)/1000)*1000

In [844]:
df_female_age_reject2.head()

   Age  Income
0   62  829000
1   29  529000
2   45  881000
3   62  814000
4   62  723000

### Expences

In [845]:
df_female_age_reject2["Expences"]=0

In [846]:
for index,income in enumerate(df_male_age_reject2["Income"]):
    if(income>=150000 and income<300000):
        saving=np.random.randint(3,7)
        df_female_age_reject2["Expences"][index]=((100-saving)*income)/100
    if(income>=300000 and income<1200000):
        saving=np.random.randint(12,15)
        df_female_age_reject2["Expences"][index]=((100-saving)*income)/100
    if(income>=1200000 and income<=1400000):
        saving=np.random.randint(15,18)
        df_female_age_reject2["Expences"][index]=((100-saving)*income)/100

###  Gender

In [847]:
df_female_age_reject2["Gender"]="F"

In [848]:
df_female_age_reject2.head()

   Age  Income  Expences Gender
0   62  829000   1031900      F
1   29  529000    426300      F
2   45  881000   1109710      F
3   62  814000    773140      F
4   62  723000    700040      F

###  cpampany

In [849]:
df_female_age_reject2["Company"]="Rank 3"

In [850]:
for index,income in enumerate(df_female_age_reject2["Income"]):
    if(income>=80000 and income<1400000):
        df_female_age_reject2["Company"][index]="Rank 2"
    if(income>=340000 and income<800000):
        df_female_age_reject2["Company"][index]="Rank 3"
    if(income>=150000 and income<340000):
        df_female_age_reject2["Company"][index]="Rank 3"

<ipython-input-850-db950bf890e1>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_reject2["Company"][index]="Rank 2"
<ipython-input-850-db950bf890e1>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_reject2["Company"][index]="Rank 3"
<ipython-input-850-db950bf890e1>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_reject2["Company"][index]="Rank 3"

### randomly adding 5%company as rank 1

In [851]:
for i in range(int(df_female_age_reject2.shape[0]*0.15)):
    index=np.random.randint(0,df_female_age_reject2.shape[0]-1)
    df_female_age_reject2["Company"][index]="Rank 1"

<ipython-input-851-f965f781d5b2>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_age_reject2["Company"][index]="Rank 1"

In [852]:
df_female_age_reject2.head()

   Age  Income  Expences Gender Company
0   62  829000   1031900      F  Rank 2
1   29  529000    426300      F  Rank 1
2   45  881000   1109710      F  Rank 2
3   62  814000    773140      F  Rank 2
4   62  723000    700040      F  Rank 3

In [853]:
df_female_age_reject2["Loan"]="Rejected"

In [854]:
df=pd.concat([df_male_age_accept,df_female_age_accept,df_male_age_reject,df_female_age_reject,df_male_age_reject2,df_female_age_reject2],axis=0)

In [855]:
df.head()

   Age   Income  Expences Gender Company      Loan
0   56  3029000   1847690      M  Rank 1  Accepted
1   29   796000    644760      M  Rank 2  Accepted
2   50  3011000   2167920      M  Rank 2  Accepted
3   46  2900000   2059000      M  Rank 1  Accepted
4   36  1746000   1361880      M  Rank 2  Accepted

In [856]:
df.shape

(10000, 6)

In [857]:
df.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1490, 1491, 1492, 1493, 1494, 1495, 1496, 1497, 1498, 1499],
           dtype='int64', length=10000)

In [859]:
df.head()

   Age   Income  Expences Gender Company      Loan
0   56  3029000   1847690      M  Rank 1  Accepted
1   29   796000    644760      M  Rank 2  Accepted
2   50  3011000   2167920      M  Rank 2  Accepted
3   46  2900000   2059000      M  Rank 1  Accepted
4   36  1746000   1361880      M  Rank 2  Accepted

In [858]:
df.to_csv("Created_Personal_Loan.csv")